---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.ForwardIterator
source: html/fc8efada-122c-e709-9b60-cd748a4f5fef.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual FamilyTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.